Repository: common-repository/pay4fun-for-woocommerce
Catalog: languages/woocommerce-pay4fun-*.po
Languages: pt_br

source: Pay4Fun for Wordpress/WooCommerce
pt_br: Pay4Fun para Wordpress/WooCommerce

source: Includes Pay4Fun as a payment gateway to WooCommerce and also adds Donation capabilities to Wordpress.
pt_br: Adiciona o Pay4Fun como um gateway de pagamento no WooCommerce e também adicionar a função de Doação no Wordpress.

source: API URL not properly set!
pt_br: A URL da API não está setada corretamente!

source: Amount field is not defined or is not numeric.
pt_br: Campo 'Amount' não está definido ou não é numérico.

source: merchantInvoiceId field is not defined or is not valid.
pt_br: Campo 'MerchantInvoiceId' não está definido ou não é válido.

source: Currency field is not defined or is not valid ISO4217 code.
pt_br: Campo 'Currency' não está definido ou não é um código ISO4217 válido.

source: ofUrl field is not defined or is not valid URL.
pt_br: Campo 'ofUrl' não está definido ou não é uma URL válida.

source: notOkUrl field is not defined or is not valid URL.
pt_br: Campo 'notOkUrl' não está definido ou não é uma URL válida.

source: confirmationUrl field is not defined or is not valid URL.
pt_br: Campo 'confirmationUrl' não está definido ou não é uma URL válida.

source: Language field is not valid (en-US/pt-BR/es-ES).
pt_br: Campo 'Language' não é uma língua válida (en-US/pt-BR/es-ES).

source: merchantLogo field is not defined or is not valid URL.
pt_br: Campo 'merchantLogo' não está definido ou não é uma URL válida.

source: p4fAccountEmail field is not a valid e-mail.
pt_br: Campo 'p4fAccountEmail' não é um email válido.

source: p4fMainId field is not a valid string.
pt_br: Campo 'p4fMainId' não é uma string válida.

source: labelId field is not defined or is not numeric.
pt_br: Campo 'labelId' não está definido ou não é numérico.

source: description field is not a valid string or is more than 40 characters.
pt_br: Campo 'description' não é uma string válida ou tem mais de 40 caracteres.

source: Accept payments by using your Pay4Fun wallet to transfer funds.
pt_br: Aceite pagamentos usando a wallet da Pay4Fun para transferir fundos.

source: Proceed to payment
pt_br: Seguir para Pagamento

source: System Status &gt; Logs
pt_br: Status do Sistema &gt; Logs

source: Enable/Disable
pt_br: Habilitar/Desabilitar

source: Enable Pay4Fun
pt_br: Habilitar Pay4Fun

source: Title
pt_br: Título

source: This controls the title which the user sees during checkout.
pt_br: Controla o título que o usuário irá ver durante o checkout.

source: Description
pt_br: Descrição

source: This controls the description which the user sees during checkout.
pt_br: Controla a Descrição que o usuário verá durante o processo de checkout.

source: Pay via pay4fun
pt_br: Pague usando Pay4Fun

source: You Merchant ID Registered on Pay4Fun
pt_br: Seu Merchant ID registrado juntamente à Pay4Fun

source: You Merchant Secret Registered on Pay4Fun
pt_br: Seu Merchant Secret registrado junto à Pay4Fun

source: You Merchant Key Registered on Pay4Fun
pt_br: Seu Merchant Key registrado juntamente à Pay4Fun

source: Merchant Logo
pt_br: Logotipo

source: Add your Logo into Pay4Fun checkout page.
pt_br: Adicione seu logo na página de checkout da Pay4Fun.

source: WC Order Prefix
pt_br: Prefixo para o Pedido

source: Use a prefix to uniquely identify your order with Pay4fun if using multiple sites.
pt_br: Use um prefixo no número do pedido para identificar unicamente o mesmo na pay4fun caso você esteja utilizando múltiplos sites.

source: Language
pt_br: Língua Padrão

source: Select the language to be used in the pay4fun checkout page.
pt_br: Seleciona a língua que será usada na página de checkout da pay4fun.

source: Complete Order on Payment?
pt_br: Finalizar Pedido ao Pagar?

source: Change order status to "Completed" once pay4fun transfer has been confirmed, otherwise it will change order status to "Processing" (Only applicable for virtual/downloadable products)
pt_br: Altera o status do pedido para "Completed" assim que a transferência de fundos for confirmada pela Pay4Fun, caso contrário o pedido ficará com status "Processing" (Aplicável somente a produtos virtuais/baixáveis)

source: Sandbox Mode?
pt_br: Modo Sandbox?

source: Run your payments in sandbox mode for testing purposes only.
pt_br: Rode os pagamentos em modo sandbox somente para realizar testes.

source: Debug Log
pt_br: Log de Debug

source: Enable logging
pt_br: Habilitar Logging

source: Log pay4fun events, such as API requests, inside %s
pt_br: Loga eventos da Pay4Fun, como requisições à API, dentro de %s

source: WooCommerce Merchant cannot be the same as the Donation Merchant.
pt_br: O Merchant do WooCommerce não pode ser o mesmo Merchant usado na Doação.

source: We are sorry, there was an error while processing your order with this payment method. Please try again, or if possible use another method. Contact our support if you need assistance.
pt_br: Pedimos desculpas, mas houve algum erro durante o processamento deste pedido usando este método de pagamento. Por favor, tente novamente, ou se possível utilize outra forma de pagamento. Entre em contato com o nosso suporte se precisar de ajuda.

source: pay4fun: Payment under review.
pt_br: pay4fun: Pagamento em análise.

source: pay4fun: Payment approved.
pt_br: pay4fun: Pagamento aprovado.

source: pay4fun: Payment completed and credited to your account.
pt_br: pay4fun: Pagamento finalizado e creditado na sua conta.

source: pay4fun: Payment came into dispute.
pt_br: pay4fun: Pagamento entrou em disputa.

source: Payment for order %s came into dispute
pt_br: Pagamento para o pedido %s entrou em disputa

source: Payment in dispute
pt_br: Pagamento em disputa

source: Order %s has been marked as on-hold, because the payment came into dispute in pay4fun.
pt_br: Pedido %s foi alterado para on-hold, porque o pagamento entrou em disputa na pay4fun.

source: pay4fun: Payment refunded.
pt_br: pay4fun: Pagamento estornado.

source: Payment for order %s refunded
pt_br: Pagamento para o pedido %s foi estornado

source: Payment refunded
pt_br: Pagamento estornado

source: Order %s has been marked as refunded by pay4fun.
pt_br: Pedido %s foi marcado como estornado pela pay4fun.

source: pay4fun: Payment canceled.
pt_br: pay4fun: Pagamento cancelado.

source: Payer email
pt_br: Email do Pagador

source: Payer name
pt_br: Nome do Pagador

source: Payment type
pt_br: Tipo de Pagamento

source: Payment method
pt_br: Método de Pagamento

source: Installments
pt_br: Parcelas

source: Payment URL
pt_br: URL de Pagamento

source: Intermediation Rate
pt_br: % de Intermediação

source: Intermediation Fee
pt_br: Taxa de Intermediação

source: Settings
pt_br: Configurações

source: Pay4Fun Donations
pt_br: Pay4Fun: Doações

source: This will delete all donations registries, are you sure?
pt_br: Esta ação irá remover todos os registros de doação no Sistema, tem certeza que deseja continuar?

source: Donations Cleared!
pt_br: Registros de doações removidos com sucesso!

source: Pay4Fun Donations (Latest 100 transactions)
pt_br: Doações com a Pay4Fun (Últimas 100 transações)

source: CLEAR ENTRIES
pt_br: Remover Registros

source: P4F Donate Button Widget
pt_br: Widget de Doação da Pay4Fun

source: This widget will add a Donate button using Pay4Fun payment method.
pt_br: Este Widget irá adicionar um botão de doação usando a Pay4Fun como método de pagamento.

source: There was an error processing p4f confirmation data
pt_br: Houve um erro ao processar os dados de confirmação da p4f

source: There was an error inserting p4f new transaction data
pt_br: Houve um erro ao tentar inserir os dados de transação da p4f

source: The OpenSSL PHP extension is not loaded in this environment. Be warned that your credentials will be stored in plain text if not enable. If you don't want this, enable the openssl extension in php.ini
pt_br: A extensão 'OpenSSL' do PHP não está habilitada neste ambiente. Esteja avisado que suas credenciais serão armazenadas em texto livre no banco de dados se o mesmo não estiver habilitado. Se você não quer que isto ocorra, habilite a extensão no seu php.ini

source: You must provide your donation Merchant ID in order to enable this functionality.
pt_br: Você deve prover o seu Merchant ID de doação para habilitar esta funcionalidade.

source: You must provide your donation Merchant KEY in order to enable this functionality.
pt_br: Você deve prover o seu Merchant KEY de doação para habilitar esta funcionalidade.

source: You must provide your donation Merchant SECRET in order to enable this functionality.
pt_br: Você deve prover o seu Merchant SECRET de doação para habilitar esta funcionalidade.

source: You must provide your donation Merchant Logo in order to enable this functionality.
pt_br: Você deve prover o seu Merchant ID de doação para habilitar esta funcionalidade.

source: You cannot use the same pay4fun merchant for both donations and woocommerce.
pt_br: Não é possível utilizar o mesmo Merchant ID para doações e woocommerce.

source: Pay4Fun Settings
pt_br: Configurações Pay4Fun

source: Clear Logs
pt_br: Limpar Logs

source: Donation Merchant cannot be the same as the WooCommerce Merchant.
pt_br: Merchant de Doação não pode ser o mesmo Merchat usado no WooCommerce.

source: This will be the log shown in Pay4Fun Checkout Page.
pt_br: Adicione seu logotipo na página de checkout da Pay4Fun.

source: This Prefix will be added to the Invoice ID in order to uniquely identify this donation when using multiple sites.
pt_br: Este prefix será adicionado ao número do pedido para que possa ser identificado de forma única a doação quando se utiliza múltiplos sites.

source: This field is to help identify the donation within Pay4Fun system.
pt_br: Este campo é usado para ajudar a identificar a doação dentro do Sistema da Pay4Fun.

source: If enabled, when the user clicks on the donate button the checkout page will be opened in a new browser window.
pt_br: Se habilitado, quando o usuário clicar no botão de doação a página de checkout será aberta em uma nova janela do browser.

source: This will enable logging the transactions for debugging purposes
pt_br: Isto irá habilitar o registro das transações para efeitos de depuração

source: Turn this on if you need to run tests to validate connectivity with pay4fun
pt_br: Habilite o modo sandbox para executar testes de conectividade com a Pay4Fun sem transações reais

source: This is the Donation Merchant ID provided to you by pay4fun. Do not use other merchant ID here.
pt_br: Este é o Merchant ID de Doação fornecido pela Pay4Fun. Não utilize nenhum outro ID de Merchant aqui.

source: This is the Donation Merchant Secret provided by pay4fun.
pt_br: Este é o Merchant Secret de doação fornecido pela Pay4Fun.

source: This is the Donation Merchant Key provided by pay4fun.
pt_br: Este é o Merchant Key de doação fornecido pela Pay4Fun.

source: This is the page to redirect the users to after a successful transaction with pay4fun.
pt_br: Está é a pagina para onde o usuário será redirecionado quando a transação for concluída com sucesso.

source: This is the page to redirect the users to when there is an error in the transaction or the user aborted the payment.
pt_br: Esta é a página em que o usuário será redirecionado quando houve algum problema na confirmação da transação, ou caso o mesmo tenha abortado o pagamento durante o checkout.

source: Select the currency that should be used to donate. All buttons will use the same currency.
pt_br: Selecione a moeda que deve ser usada para realizar a doação. Todos os botões irão usar a mesma moeda.

source: Select the language to be used in the checkout page.
pt_br: Seleciona a língua que será usada na página de checkout da pay4fun.

source: Pay4Fun Donation API Credentials
pt_br: Credencias da Pay4Fun para a API Wordpress

source: Other Settings
pt_br: Demais Configurações

source: Order Prefix
pt_br: Prefixo do Pedido

source: Currency
pt_br: Moeda

source: Donate Success Return Page
pt_br: Página de Retorno (Sucesso)

source: Donate Error Return Page
pt_br: Página de Retorno (Falha)

source: Redirect to new Page?
pt_br: Redirecionar em Nova Página?

source: Enable Debug?
pt_br: Habilitar Log?

source: Please provide you Pay4Fun API credentials
pt_br: Por favor informe as credenciais da API da Pay4Fun

source: Remaining Settings to configure Pay4Fun Donations
pt_br: Demais configurações para habilitar as doações com a Pay4Fun

source: Donations Credentials should be set in
pt_br: As credenciais do merchant deverão ser setadas em

source: Pay4Fun Donations Settings Page
pt_br: Página de Configuração da Doação via Pay4Fun

source: Pay4Fun is Disabled
pt_br: Pay4Fun está desabilitado

source: Currency <code>%s</code> is not supported. Works only with Brazilian Real, US Dollar or Euro.
pt_br: Moeda <code>%s</code> não é suportada. Somente o Real, Dólar e Euro são aceitos.

source: Pay4Fun Disabled
pt_br: Pay4Fun Desabilitado

source: You should inform your merchant ID.
pt_br: Você deve informar seu ID de merchant.

source: You should inform your merchant key.
pt_br: Você deve informar sua key de merchant.

source: You should inform your logo.
pt_br: Você deve informar seu logotipo.

source: Pay4Fun for WooCommerce
pt_br: Pay4Fun para WooCommerce

source: depends on the last version of WooCommerce to work!
pt_br: depende da última versão do WooCommerce para funcionar!

source: Active WooCommerce
pt_br: Ativar WooCommerce

source: Install WooCommerce
pt_br: Instalar WooCommerce

source: Merchant Conflict!
pt_br: Conflito de Merchant ID!

source: You cannot use the same merchant ID for both Donation and WooCommerce.
pt_br: Você não pode usar o mesmo Merchant ID para Doações e WooCommerce.

source: You should inform your merchant secret.
pt_br: Você deve informar seu secret de merchant.

source: Cancel your Order
pt_br: Cancelar seu Pedido
